/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kwsong <kwsong@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/02/14 22:38:57 by kwsong            #+#    #+#             */
/*   Updated: 2023/02/14 22:39:23 by kwsong           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
먼저 좀비 클래스를 구현합니다. 문자열 private 속성 이름이 있습니다.
좀비 클래스에 멤버 함수 void nounce(void);를 추가합니다.
좀비는 다음과 같이 자신을 발표한다:
<이름>: BraiiiiinnzzZ...
꺾쇠괄호(< 및 >)는 인쇄하지 마십시오. 이름이 Foo인 좀비의 메시지는 다음과 같습니다:
Foo: Braiiiinnzzz...

• Zombie* newZombie(std:: 문자열 이름);
좀비를 생성하고 이름을 지정한 후 반환하므로 기능 범위 밖에서 사용할 수 있습니다.

• void randomChump(std::string name);
그것은 좀비를 만들고, 이름을 짓고, 좀비는 스스로를 발표한다.

자, 이 연습의 실제 요점은 무엇일까요? 
당신은 어떤 경우에 좀비를 스택이나 힙에 할당하는 것이 더 나은지 결정해야 한다.

좀비들은 당신이 더 이상 필요하지 않을 때 파괴되어야 한다.
디스트럭터는 디버깅을 위해 좀비의 이름으로 메시지를 인쇄해야 합니다.
*/

int main()
{
	
}